season_choice = [(1, '第一弹'), (2, '第二弹'), (3, '第三弹'), (4, '第四弹'),
                 (5, '传说一弹'), (6, '传说二弹'), (7, '传说三弹'), (8, '传说四弹'),
                 (9, '冲锋一弹'), (10, '冲锋二弹'), (11, '冲锋三弹'), (12, '冲锋四弹'), (13, '冲锋五弹'),
                 (14, '冲锋六弹'),(None, '无')]
star_choice = [(1, '一星'), (2, '二星'), (3, '三星'), (4, '四星'), (5, '五星'), (None, '无')]
sp_system_choice = [(None, '无'), (1, 'Mega进化'), (2, 'Z招式'), (4, '合体'), (8, '双重冲击'), (16, '冲锋连击'), (9, 'Mega+双重冲击')]
type_choice = [(None, '无'), ('一般', '一般'), ('火', '火'), ('水', '水'), ('电', '电'), ('草', '草'), ('冰', '冰'), ('格斗', '格斗'),
               ('毒', '毒'), ('地面', '地面'),
               ('飞行', '飞行'),
               ('超能力', '超能力'), ('虫', '虫'), ('岩石', '岩石'), ('幽灵', '幽灵'), ('龙', '龙'), ('恶', '恶'),
               ('钢', '钢'), ('妖精', '妖精')]


def common_escaped(value, choice):
    for x, y in choice:
        if value == x:
            return y
    return None
